package com.gradation.lift.ui.utils

object TermsPolicyContent {

    const val MARKTETING_CONENT =
        """본 마케팅 정보 수신 동의는 선택사항으로, 동의를 거부하시더라도 리프트 서비스 이용에는 제약이 없습니다. 다만, 마케팅 정보수신 거부시 리프트 제공하는 유용한 안내를 받지 못하실 수 있습니다.
1. 마케팅 및 광고에의 활용
* 신규 기능 개발 및 맞춤 서비스 제공
* 뉴스레터 발송, 새로운 기능(제품)의 안내

2. 마케팅 정보 제공
리프트 서비스를 운용하는 과정에서 각종 정보를 서비스 화면, SMS, 푸시 알림, 이메일 등의 방법으로 회원에게 제공할 수 있으며, 약관 변경, 공지 등 의무적으로 안내해야 하는 정보성 내용 및 일부 혜택성 정보는 수신동의 여부와 무관하게 제공합니다.

3. 수신 동의 및 철회
리프트에서 제공하는 마케팅 정보를 원하지 않을 경우 ‘설정 > 마케팅 정보 수신 동의 설정’에서 철회를 요청할 수 있습니다. 또한 향후 마케팅 활용에 새롭게 동의하고자 하는 경우 ‘설정 > 마케팅 정보 수신 동의 설정’에서 동의하실 수 있습니다."""


    const val PRIVACY_POLICY_CONTENT = """
1. 개인정보의 처리목적
리프트는 다음과 같은 개인정보처리방침을 가지고 있으며, 다음의 목적 이의외 용도로는 절대 이용하지 않습니다. 이용 목적이 변경되는 경우에는 「개인정보 보호법」 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.
	1	회원 가입 및 관리 회원 가입 의사 확인, 이용자의 본인 확인, 이용자 식별, 회원탈퇴 의사의 확인과 같이 회원관리를 위하여 개인정보를 이용합니다.
	2	신규 서비스 개발 및 개선 개인 정보의 기반하에 사용자에게 새로운 서비스를 제공하기 위해 개인정보를 이용합니다.
	3	서비스 운영 및 유지보수를 위한 통계 자료 도출



2. 수집되는 개인정보
리프트는 서비스 제공을 위해 최소한의 개인정보만을 수집합니다.
	1	회원 가입시 수집되는 항목
        ◦	공통
            ▪	성별
        ◦	카카오 로그인
            ▪	이메일
            ▪	회원 식별 아이디
        ◦	구글 로그인
            ▪	이메일
            ▪	회원 식별 아이디
        ◦	네이버 로그인
            ▪	이메일
            ▪	회원 식별 아이디
        ◦	일반 로그인
            ▪	이메일
            ▪	비밀번호
	2	서비스 이용 시 수집되는 항목
	    ◦	서비스 이용 내역



3. 개인정보의 처리 및 보유 기간
	•	리프트는 법령에 따른 개인정보 보유·이용기간 또는 정보 주체로부터 개인정보를 수집 시에 동의 받은 개인정보 보유·이용기간 내에서 개인정보를 처리·보유합니다
	•	사용자가 서비스 해지를 요청하거나 개인정보 수집 및 이용에 대한 동의를 철회하는 경우, 즉시 개인정보를 파기합니다.



4. 개인정보의 파기절차 및 방법
	•	개인정보는 이용목적이 달성되면 지체없이 파기하며, 절차 및 방법은 다음과 같습니다.
	•	전자적 파일 형태인 경우 복구 및 재생되지 않도록 안전하게 삭제하고, 그 밖에 기록물, 인쇄물, 서면 등의 경우 분쇄하거나 소각하여 파기합니다.




"""


    const val TERMS_OF_USE_CONTENT = """
제1조 (목적)
	1	본 약관은 리프트가 제공하는 서비스를 이용함에 있어 당사자의 권리 의무 및 책임사항을 규정하는 것을 목적으로 합니다.



제2조 (정의)
	1	서비스라 함은 ”회사”가 제공하는 리프트 애플리케이션을 통하여 애플리케이션이 가진 기능을 사용할 수 있도록 하는 제반 서비스를 의미합니다.
	2	'이용자'라 함은, '사이트'에 접속하여 본 약관에 따라 '회사'가 제공하는 서비스를 받는 회원을 말합니다.
	3	'회원'이라 함은, '회사'에 개인정보를 제공하고 회원으로 등록한 자로서, '회사'의 서비스를 계속하여 이용할 수 있는 자를 말합니다.



제3조 (약관 외 준칙)
	1	본 약관에 규정되지 않은 사항에 대해서는 회사가 정한 서비스 운영정책 및 세부규칙, 약관의 규제에 관한 법률, 개인정보보호법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 등 관련법령 또는 상관습에 따릅니다.



제4조 (약관의 명시 및 개정)
	1	본 약관은 서비스내 게시하거나 이용자에게 공지함으로 효력이 발생합니다.
	2	본 약관은 이용자가 약관에 동의하고 서비스 신청을 함으로써 효력이 발생합니다.
	3	회사는 관계법령을 위배하지 않는 범위에서 법률이나 서비스의 변경사항 등을 반영하기 위한 목적 등으로 본 약관을 개정할 수 있습니다.
	4	회사가 약관을 개정할 경우에는 기존약관과 개정약관 및 개정약관의 적용일자와 개정사유를 명시하여 현행약관과 함께 그 적용일자 7일 전부터 적용일 이후 상당한 기간 동안, 개정내용이 이용자에게 불리한 경우에는 그 적용일자 30일 전부터 적용일 이후 상당한 기간 동안 사전 유예기간을 두고, 각각 이를 서비스에 연결된 화면에 공지합니다.
	5	회사가 전항에 따라 이용자에게 통지하면서 공지 또는 공지·고지일로부터 개정약관 시행일 7일 후 또는 30일 후까지 거부의사를 표시하지 않으면 승인한 것으로 본다는 뜻을 명확하게 고지하였음에도, 의사표시가 없는 경우에는 변경된 약관을 승인한 것으로 봅니다.
	6	이용자가 개정약관에 동의하지 않을 경우 이용자는 서비스 이용을 중지하거나 해지할 수 있습니다.



제5조 (서비스 이용의 탈퇴 및 제한)
	1	회원은 서비스에 언제든지 탈퇴를 요청할 수 있으며 서비스는 즉시 회원탈퇴를 처리합니다.
	2	회사는 다음 각 호의 사유가 발생한 경우에는 이용자의 서비스 이용을 중지시킬 수 있습니다.
	◦	이용자가 회사의 서비스 운영을 고의 또는 중과실로 방해하는 행위
	◦	이용자의 정보에 허위 내용을 등록하는 행위
	◦	회사의 서비스에 게시된 정보를 변경하거나 서비스를 이용하여 얻은 정보를 회사의 사전 승낙 없이 영리 또는 비영리의 목적으로 복제, 출판, 방송 등에 사용하거나 제3자에게 제공하는 행위
	◦	회사 기타 제3자의 명예를 훼손하거나 지적재산권을 침해하는 등 회사나 제3자의 권리를 침해하는 행위
	◦	다른 이용자의 정보를 도용하여 부당하게 서비스를 이용한 경우



제6조 (회사의 권리 및 의무)
	1	회사는 서비스의 신뢰도를 위하여 회원에게 온라인상의 본인인증 절차를 거치도록 요구할 수 있습니다.
	2	회사는 서비스의 향상을 위해 이용자들의 이용 정보들을 비식별화 하여 통계 및 분석에 사용할 수 있습니다.
	3	회사는 회사의 서비스 제공 및 보안과 관련된 설비를 지속적이고 안정적인 서비스 제공에 적합하도록 유지, 점검 또는 복구 등의 조치를 성실히 이행하여야 합니다.
	4	회사는 서비스의 이용과 관련하여 이용자가 불만이나 개선 의견을 제시하는 경우, 합리적인 절차에 따라 이를 검토하여 서비스 이용에 도움이 되는 범위에서 이를 반영할 수 있습니다.
	5	회사는 이용자이 원하지 아니하는 영리 목적의 광고성 전자우편이나 SMS를 발송하지 않습니다.
	6	회사는 서비스의 제공과 관련하여 알게 된 이용자의 개인정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않고, 이를 보호하기 위하여 노력합니다. 회원의 개인정보보호에 관한 기타의 사항은 정보통신망이용촉진 및 정보보호 등에 관한 법률 등 관계법령 및 회사가 별도로 정한 개인정보취급방침에 따릅니다.



부 칙
제1조(시행일)
본 약관은 2024년 2월 8일에 개정되었으며, 2024년 2월 8일 적용합니다.




"""
}